zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_VIRT_WRAPPER.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K358_VIRT_WRAPPER.h
 * @version 1.1
 * @date 2022-10-01
 * @brief Peripheral Access Layer for S32K358_VIRT_WRAPPER
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K358_VIRT_WRAPPER_H_)  /* Check if memory map has not been already included */
#define S32K358_VIRT_WRAPPER_H_

#include "S32K358_COMMON.h"

/* ----------------------------------------------------------------------------
   -- VIRT_WRAPPER Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VIRT_WRAPPER_Peripheral_Access_Layer VIRT_WRAPPER Peripheral Access Layer
 * @{
 */

/** VIRT_WRAPPER - Size of Registers Arrays */
#define VIRT_WRAPPER_REG_C_COUNT                  1u

/** VIRT_WRAPPER - Register Layout Typedef */
typedef struct {
  __IO uint32_t REG_A0;                            /**< Parameter_n Register, offset: 0x0 */
  __IO uint32_t REG_A1;                            /**< Parameter_n Register, offset: 0x4 */
  __IO uint32_t REG_A2;                            /**< Parameter_n Register, offset: 0x8 */
  __IO uint32_t REG_A3;                            /**< Parameter_n Register, offset: 0xC */
  __IO uint32_t REG_A4;                            /**< Parameter_n Register, offset: 0x10 */
  __IO uint32_t REG_A5;                            /**< Parameter_n Register, offset: 0x14 */
  __IO uint32_t REG_A6;                            /**< Parameter_n Register, offset: 0x18 */
  __IO uint32_t REG_A7;                            /**< Parameter_n Register, offset: 0x1C */
  __IO uint32_t REG_A8;                            /**< Parameter_n Register, offset: 0x20 */
  __IO uint32_t REG_A9;                            /**< Parameter_n Register, offset: 0x24 */
  __IO uint32_t REG_A10;                           /**< Parameter_n Register, offset: 0x28 */
  __IO uint32_t REG_A11;                           /**< Parameter_n Register, offset: 0x2C */
  __IO uint32_t REG_A12;                           /**< Parameter_n Register, offset: 0x30 */
  __IO uint32_t REG_A13;                           /**< Parameter_n Register, offset: 0x34 */
  __IO uint32_t REG_A14;                           /**< Parameter_n Register, offset: 0x38 */
  uint8_t RESERVED_0[68];
  __IO uint32_t REG_B0;                            /**< Parameter_n Register, offset: 0x80 */
  __IO uint32_t REG_B1;                            /**< Parameter_n Register, offset: 0x84 */
  __IO uint32_t REG_B2;                            /**< Parameter_n Register, offset: 0x88 */
  __IO uint32_t REG_B3;                            /**< Parameter_n Register, offset: 0x8C */
  __IO uint32_t REG_B4;                            /**< Parameter_n Register, offset: 0x90 */
  __IO uint32_t REG_B5;                            /**< Parameter_n Register, offset: 0x94 */
  __IO uint32_t REG_B6;                            /**< Parameter_n Register, offset: 0x98 */
  __IO uint32_t REG_B7;                            /**< Parameter_n Register, offset: 0x9C */
  __IO uint32_t REG_B8;                            /**< Parameter_n Register, offset: 0xA0 */
  __IO uint32_t REG_B9;                            /**< Parameter_n Register, offset: 0xA4 */
  __IO uint32_t REG_B10;                           /**< Parameter_n Register, offset: 0xA8 */
  __IO uint32_t REG_B11;                           /**< Parameter_n Register, offset: 0xAC */
  __IO uint32_t REG_B12;                           /**< Parameter_n Register, offset: 0xB0 */
  __IO uint32_t REG_B13;                           /**< Parameter_n Register, offset: 0xB4 */
  __IO uint32_t REG_B14;                           /**< Parameter_n Register, offset: 0xB8 */
  __IO uint32_t REG_B15;                           /**< Parameter_n Register, offset: 0xBC */
  __IO uint32_t REG_B16;                           /**< Parameter_n Register, offset: 0xC0 */
  uint8_t RESERVED_1[4];
  __IO uint32_t REG_B18;                           /**< Parameter_n Register, offset: 0xC8 */
  __IO uint32_t REG_B19;                           /**< Parameter_n Register, offset: 0xCC */
  __IO uint32_t REG_B20;                           /**< Parameter_n Register, offset: 0xD0 */
  __IO uint32_t REG_B21;                           /**< Parameter_n Register, offset: 0xD4 */
  __IO uint32_t REG_B22;                           /**< Parameter_n Register, offset: 0xD8 */
  __IO uint32_t REG_B23;                           /**< Parameter_n Register, offset: 0xDC */
  __IO uint32_t REG_B24;                           /**< Parameter_n Register, offset: 0xE0 */
  __IO uint32_t REG_B25;                           /**< Parameter_n Register, offset: 0xE4 */
  __IO uint32_t REG_B26;                           /**< Parameter_n Register, offset: 0xE8 */
  __IO uint32_t REG_B27;                           /**< Parameter_n Register, offset: 0xEC */
  uint8_t RESERVED_2[16];
  __IO uint32_t REG_C[VIRT_WRAPPER_REG_C_COUNT];   /**< Parameter_n Register, array offset: 0x100, array step: 0x4 */
} VIRT_WRAPPER_Type, *VIRT_WRAPPER_MemMapPtr;

/** Number of instances of the VIRT_WRAPPER module. */
#define VIRT_WRAPPER_INSTANCE_COUNT              (1u)

