zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_VIRT_WRAPPER.h
#define VIRT_WRAPPER_REG_B11_INMUX_8_MASK        (0x30000U)
#define VIRT_WRAPPER_REG_B11_INMUX_8_SHIFT       (16U)
#define VIRT_WRAPPER_REG_B11_INMUX_8_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B11_INMUX_8(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B11_INMUX_8_SHIFT)) & VIRT_WRAPPER_REG_B11_INMUX_8_MASK)

#define VIRT_WRAPPER_REG_B11_INMUX_9_MASK        (0xC0000U)
#define VIRT_WRAPPER_REG_B11_INMUX_9_SHIFT       (18U)
#define VIRT_WRAPPER_REG_B11_INMUX_9_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B11_INMUX_9(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B11_INMUX_9_SHIFT)) & VIRT_WRAPPER_REG_B11_INMUX_9_MASK)

#define VIRT_WRAPPER_REG_B11_INMUX_10_MASK       (0x300000U)
#define VIRT_WRAPPER_REG_B11_INMUX_10_SHIFT      (20U)
#define VIRT_WRAPPER_REG_B11_INMUX_10_WIDTH      (2U)
#define VIRT_WRAPPER_REG_B11_INMUX_10(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B11_INMUX_10_SHIFT)) & VIRT_WRAPPER_REG_B11_INMUX_10_MASK)

#define VIRT_WRAPPER_REG_B11_INMUX_11_MASK       (0xC00000U)
#define VIRT_WRAPPER_REG_B11_INMUX_11_SHIFT      (22U)
#define VIRT_WRAPPER_REG_B11_INMUX_11_WIDTH      (2U)
#define VIRT_WRAPPER_REG_B11_INMUX_11(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B11_INMUX_11_SHIFT)) & VIRT_WRAPPER_REG_B11_INMUX_11_MASK)

#define VIRT_WRAPPER_REG_B11_INMUX_12_MASK       (0x3000000U)
#define VIRT_WRAPPER_REG_B11_INMUX_12_SHIFT      (24U)
#define VIRT_WRAPPER_REG_B11_INMUX_12_WIDTH      (2U)
#define VIRT_WRAPPER_REG_B11_INMUX_12(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B11_INMUX_12_SHIFT)) & VIRT_WRAPPER_REG_B11_INMUX_12_MASK)

#define VIRT_WRAPPER_REG_B11_INMUX_13_MASK       (0xC000000U)
#define VIRT_WRAPPER_REG_B11_INMUX_13_SHIFT      (26U)
#define VIRT_WRAPPER_REG_B11_INMUX_13_WIDTH      (2U)
#define VIRT_WRAPPER_REG_B11_INMUX_13(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B11_INMUX_13_SHIFT)) & VIRT_WRAPPER_REG_B11_INMUX_13_MASK)

#define VIRT_WRAPPER_REG_B11_INMUX_14_MASK       (0x30000000U)
#define VIRT_WRAPPER_REG_B11_INMUX_14_SHIFT      (28U)
#define VIRT_WRAPPER_REG_B11_INMUX_14_WIDTH      (2U)
#define VIRT_WRAPPER_REG_B11_INMUX_14(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B11_INMUX_14_SHIFT)) & VIRT_WRAPPER_REG_B11_INMUX_14_MASK)

#define VIRT_WRAPPER_REG_B11_INMUX_15_MASK       (0xC0000000U)
#define VIRT_WRAPPER_REG_B11_INMUX_15_SHIFT      (30U)
#define VIRT_WRAPPER_REG_B11_INMUX_15_WIDTH      (2U)
#define VIRT_WRAPPER_REG_B11_INMUX_15(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B11_INMUX_15_SHIFT)) & VIRT_WRAPPER_REG_B11_INMUX_15_MASK)
/*! @} */

/*! @name REG_B12 - Parameter_n Register */
/*! @{ */

#define VIRT_WRAPPER_REG_B12_INMUX_0_MASK        (0x3U)
#define VIRT_WRAPPER_REG_B12_INMUX_0_SHIFT       (0U)
#define VIRT_WRAPPER_REG_B12_INMUX_0_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_0(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_0_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_0_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_1_MASK        (0xCU)
#define VIRT_WRAPPER_REG_B12_INMUX_1_SHIFT       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_1_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_1(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_1_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_1_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_2_MASK        (0x30U)
#define VIRT_WRAPPER_REG_B12_INMUX_2_SHIFT       (4U)
#define VIRT_WRAPPER_REG_B12_INMUX_2_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_2(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_2_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_2_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_3_MASK        (0xC0U)
#define VIRT_WRAPPER_REG_B12_INMUX_3_SHIFT       (6U)
#define VIRT_WRAPPER_REG_B12_INMUX_3_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_3(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_3_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_3_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_4_MASK        (0x300U)
#define VIRT_WRAPPER_REG_B12_INMUX_4_SHIFT       (8U)
#define VIRT_WRAPPER_REG_B12_INMUX_4_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_4(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_4_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_4_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_5_MASK        (0xC00U)
#define VIRT_WRAPPER_REG_B12_INMUX_5_SHIFT       (10U)
#define VIRT_WRAPPER_REG_B12_INMUX_5_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_5(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_5_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_5_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_6_MASK        (0x3000U)
#define VIRT_WRAPPER_REG_B12_INMUX_6_SHIFT       (12U)
#define VIRT_WRAPPER_REG_B12_INMUX_6_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_6(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_6_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_6_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_7_MASK        (0xC000U)
#define VIRT_WRAPPER_REG_B12_INMUX_7_SHIFT       (14U)
#define VIRT_WRAPPER_REG_B12_INMUX_7_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_7(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_7_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_7_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_8_MASK        (0x30000U)
#define VIRT_WRAPPER_REG_B12_INMUX_8_SHIFT       (16U)
#define VIRT_WRAPPER_REG_B12_INMUX_8_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_8(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_8_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_8_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_9_MASK        (0xC0000U)
#define VIRT_WRAPPER_REG_B12_INMUX_9_SHIFT       (18U)
#define VIRT_WRAPPER_REG_B12_INMUX_9_WIDTH       (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_9(x)          (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_9_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_9_MASK)

#define VIRT_WRAPPER_REG_B12_INMUX_10_MASK       (0x300000U)
#define VIRT_WRAPPER_REG_B12_INMUX_10_SHIFT      (20U)
#define VIRT_WRAPPER_REG_B12_INMUX_10_WIDTH      (2U)
#define VIRT_WRAPPER_REG_B12_INMUX_10(x)         (((uint32_t)(((uint32_t)(x)) << VIRT_WRAPPER_REG_B12_INMUX_10_SHIFT)) & VIRT_WRAPPER_REG_B12_INMUX_10_MASK)
/*! @} */

/*! @name REG_B13 - Parameter_n Register */
/*! @{ */

